todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-30 Tue 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TODO</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">TODO</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5fba779">Planetbanatt.net TODO list</a>
<ul>
<li><a href="#org96a68e9">Website TODOs</a></li>
<li><a href="#orga0e377d">Article TODOs</a></li>
<li><a href="#org0f3158c">System TODOs</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5fba779" class="outline-1">
<h1 id="org5fba779">Planetbanatt.net TODO list</h1>
<div class="outline-text-1" id="text-org5fba779">
<p>
There are lots of things I still need to do for this website. 
</p>
</div>

<div id="outline-container-org96a68e9" class="outline-2">
<h2 id="org96a68e9">Website TODOs</h2>
<div class="outline-text-2" id="text-org96a68e9">
<ul class="org-ul">
<li><b>Links Page Updates Through July</b>: As always I have fallen behind on this</li>
<li><b>Fix code syntax highlighting</b>: This was broken at some point</li>
<li><b>Overall code cleanup</b>: Lots of hacky stuff needs improving</li>
<li><b>SSBMRank Portal</b>: Data stuff can probably be linked to from the recently refactored Melee tab.</li>
<li><b>Youtube Channel scrape for vods viewer</b>: Not sure how much I want to dig into this but too much stuff does not leverage the liquipedia API as I thought</li>
</ul>
</div>
</div>

<div id="outline-container-orga0e377d" class="outline-2">
<h2 id="orga0e377d">Article TODOs</h2>
<div class="outline-text-2" id="text-orga0e377d">
<ul class="org-ul">
<li><b>Learning Riichi Mahjong</b></li>
<li><b>Arcades as Multi-Arm Bandit Problem Article</b></li>
<li><b>CRT Technology and Downstream Game Design</b></li>
<li><b>Anime and Transhumanism Article</b></li>
<li><b>Post Training LLMs Article</b></li>
<li><b>Read more Deep RL Papers</b></li>
</ul>
</div>
</div>

<div id="outline-container-org0f3158c" class="outline-2">
<h2 id="org0f3158c">System TODOs</h2>
<div class="outline-text-2" id="text-org0f3158c">
<ul class="org-ul">
<li>loop in LLM for website work management. Maybe scratchpad document which gets sorted into notebook bins. Streamline notetaking from single text input buffer into several distinct destinations.</li>
</ul>

<p>
Overall there's still way too much manually moving things around. There's a vision of putting stuff in and having it appear inside here somewhere and then being able to spend all the time just thinking as much as possible. Need to make that something more like a reality. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
